2024-01-14-TryOrgPublish/notes.org
#+TITLE: Review org-publish Utility
#+AUTHOR: Dou Meishi
#+DATE: [2024-01-14]
#+FILETAGS: emacs

Recently, I finally decided to create my personal blog site. I
researched a few tools and then I suddenly remembered the =org-publish=
function in Emacs. Although I have been using Emacs and Org mode for
three years, I never wrote a script in elisp. But since my interest in
Emacs is continuously growing, I think it's a good time to play around
with it. It is also a good practice for me to understand the source code
of [[https://github.com/bastibe/org-static-blog/tree/master][Org Static Blog]], which is the actual blogging tool I want to use.

** Go through the manual

According to [[https://orgmode.org/manual/Publishing.html][the manual]], publishing in org-mode is configured almost
entirely through setting the value of one variable, called
=org-publish-project-alist=. Each element of the list configures one
project, and may be in one of the two following forms:

1. =("project-name" :property value :property value ...)=
2. =("project-name" :components ("project-name" "project-name" ...))=

After properly configuring the variable, calling =org-publish= will prompt for a project name
and publish all files that belong to it. Calling =org-publish-all= will publish all projects.

Publishing means that a file is copied to the destination directory and possibly transformed in the process.
The transformation is controlled by the property =publishing-function=. Typical values include

1. =org-html-publish-to-html=, which calls the HTML exporter to export org files to HTML files;
2. =org-publish-attachment=, which does not modify files but simply copy them.

We may also generate a sitemap for a given project by customizing following properties;
see [[https://orgmode.org/manual/Site-map.html][Section 14.1.7]] in the org manual. Interesting properties include:

1. =sitemap-format-entry=: tell how a published entry is formatted in the sitemap;
2. =sitemap-sort-folders=: where folders should appear in the sitemap;
3. =sitemap-sort-files=: how the files are sorted in the sitemap.

** Practice

/A simple setting:/ given a folder =./content= with several org files in it, we want to publish them
into a different folder =./public=. Assets should be copied too.

#+BEGIN_QUOTE
It is convenient to put publishing related source in a standalone =build.el= file.
Visit it in Emacs and call =eval-buffer= to publish projects defined it.
#+END_QUOTE

First, we define our =sitemap-format-entry= function, which will format an entry into
a timestamp followed by a URL whose description is the title of the entry.

#+BEGIN_SRC elisp :tangle ./build.el
(defun dms/org-sitemap-format-entry (entry style project)
  "Format ENTRY in org-publish PROJECT Sitemap as [date] [[file][title]]."
  (let ((filetitle (org-publish-find-title entry project)))
    (if (= (length filetitle) 0)
        (format "*%s*" entry)
      (format "[%s] [[file:%s][%s]]"
              (format-time-string "%Y-%m-%d"
                                  (org-publish-find-date entry project))
              entry
              filetitle))))
#+END_SRC

Then, we set =org-publish-project-alist=. We create two projects, one for exporting org files
and other one for copying assets. Both projects recursively search files based on a particular REGEXP on
file extension. In addition, we require to generate a sitemap and format entries by our
=dms/org-sitemap-format-entry= function. In addition, entries  are sorted by date
and organized as a plain list, instead of nested list containing subfolders.

#+BEGIN_SRC elisp :tangle ./build.el
;; Define the publishing project
(setq org-publish-project-alist
      (list
       (list "try-org-publish-org"
             :base-directory "./content"
             :base-extension "org"
             :publishing-directory "./public"
             :publishing-function 'org-html-publish-to-html
             :recursive t
             :auto-sitemap t
             :sitemap-title "Doumeishi's Mainpage"
             :sitemap-format-entry 'dms/org-sitemap-format-entry
             :sitemap-sort-files 'anti-chronologically
             :sitemap-style 'list
             )
       (list "try-org-publish-assets"
             :base-directory "./content"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|mov"
             :publishing-directory "./public"
             :publishing-function 'org-publish-attachment
             :recursive t
             )
       )
)
#+END_SRC

Finally, we publish all projects.

#+BEGIN_SRC elisp :tangle ./build.el
;; Generate the site output
(org-publish-all t)

(message "Publish complete!")
#+END_SRC

