2024-01-14-TryOrgPublish/notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://dou-meishi.github.io/org-blog/rss.xml"
      title="RSS feed for https://dou-meishi.github.io/org-blog/">
<title>Review org-publish Utility</title>
<meta name="author" content="Dou Meishi">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link href= "https://gongzhitaao.org/orgcss/org.css" rel="stylesheet" type="text/css" />
<link href= "https://dou-meishi.github.io/org-blog/static/dou-org-blog.css" rel="stylesheet" type="text/css" />
<!-- Math Support by KaTeX -->
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.16.9/dist/katex.min.css" integrity="sha384-n8MVd4RsNIU0tAv4ct0nTaAbDJwPJzDEaqSD1odI+WdtXRGWt2kTvGFasHpSy3SV" crossorigin="anonymous">
<!-- The loading of KaTeX is deferred to speed up page rendering -->
<!-- To automatically render math in text elements, include the auto-render extension: -->
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <div class="sitelinks">
    <a href="https://dou-meishi.github.io/org-blog/index.html">Home</a>
    |
    <a href="https://dou-meishi.github.io/org-blog/archive.html">All Posts</a>
  </div>
</div>
</div>
<div id="content">
<div class="post-date">14 Jan 2024</div><h1 class="post-title"><a href="https://dou-meishi.github.io/org-blog/2024-01-14-TryOrgPublish/notes.html">Review org-publish Utility</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7dc29ae">Go through the manual</a></li>
<li><a href="#orgb8d7e04">Practice</a></li>
<li><a href="#orgfa168e2">Questions</a></li>
<li><a href="#orgcd12596">Further consideration</a></li>
<li><a href="#org0627a4c">External Links&#xa0;&#xa0;&#xa0;<span class="tag"><span class="refs">refs</span></span></a></li>
</ul>
</div>
</nav>
<p>
Recently, I finally decided to create my personal blog site. I
researched a few tools and then I suddenly remembered the <code>org-publish</code>
function in Emacs. Although I have been using Emacs and Org mode for
three years, I never wrote a script in elisp. But since my interest in
Emacs is continuously growing, I think it's a good time to play around
with it. It is also a good practice for me to understand the source code
of <a href="https://github.com/bastibe/org-static-blog/tree/master">Org Static Blog</a>, which is the actual blogging tool I want to use.
</p>

<div id="outline-container-org7dc29ae" class="outline-2">
<h2 id="org7dc29ae">Go through the manual</h2>
<div class="outline-text-2" id="text-org7dc29ae">
<p>
According to <a href="https://orgmode.org/manual/Publishing.html">the manual</a>, publishing in org-mode is configured almost
entirely through setting the value of one variable, called
<code>org-publish-project-alist</code>. Each element of the list configures one
project, and may be in one of the two following forms:
</p>

<ol class="org-ol">
<li><code>("project-name" :property value :property value ...)</code></li>
<li><code>("project-name" :components ("project-name" "project-name" ...))</code></li>
</ol>

<p>
After properly configuring the variable, calling <code>org-publish</code> will prompt for a project name
and publish all files that belong to it. Calling <code>org-publish-all</code> will publish all projects.
</p>

<p>
Publishing means that a file is copied to the destination directory and possibly transformed in the process.
The transformation is controlled by the property <code>publishing-function</code>. Typical values include
</p>

<ol class="org-ol">
<li><code>org-html-publish-to-html</code>, which calls the HTML exporter to export org files to HTML files;</li>
<li><code>org-publish-attachment</code>, which does not modify files but simply copy them.</li>
</ol>

<p>
We may also generate a sitemap for a given project by customizing following properties;
see <a href="https://orgmode.org/manual/Site-map.html">Section 14.1.7</a> in the org manual. Interesting properties include:
</p>

<ol class="org-ol">
<li><code>sitemap-format-entry</code>: tell how a published entry is formatted in the sitemap;</li>
<li><code>sitemap-sort-folders</code>: where folders should appear in the sitemap;</li>
<li><code>sitemap-sort-files</code>: how the files are sorted in the sitemap.</li>
</ol>
</div>
</div>

<div id="outline-container-orgb8d7e04" class="outline-2">
<h2 id="orgb8d7e04">Practice</h2>
<div class="outline-text-2" id="text-orgb8d7e04">
<p>
<i>A simple setting:</i> given a folder <code>./content</code> with several org files in it, we want to publish them
into a different folder <code>./public</code>. Assets should be copied too.
</p>

<blockquote>
<p>
It is convenient to put publishing related source in a standalone <code>build.el</code> file.
Visit it in Emacs and call <code>eval-buffer</code> to publish projects defined it.
</p>
</blockquote>

<p>
First, we define our <code>sitemap-format-entry</code> function, which will format an entry into
a timestamp followed by a URL whose description is the title of the entry.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">dms/org-sitemap-format-entry</span> (entry style project)
  <span style="color: #2aa198;">"Format ENTRY in org-publish PROJECT Sitemap as [date] [[file][title]]."</span>
  (<span style="color: #859900; font-weight: bold;">let</span> ((filetitle (org-publish-find-title entry project)))
    (<span style="color: #859900; font-weight: bold;">if</span> (= (length filetitle) 0)
        (format <span style="color: #2aa198;">"*%s*"</span> entry)
      (format <span style="color: #2aa198;">"[%s] [[file:%s][%s]]"</span>
              (format-time-string <span style="color: #2aa198;">"%Y-%m-%d"</span>
                                  (org-publish-find-date entry project))
              entry
              filetitle))))
</pre>
</div>

<p>
Then, we set <code>org-publish-project-alist</code>. We create two projects, one for exporting org files
and other one for copying assets. Both projects recursively search files based on a particular REGEXP on
file extension. In addition, we require to generate a sitemap and format entries by our
<code>dms/org-sitemap-format-entry</code> function. In addition, entries  are sorted by date
and organized as a plain list, instead of nested list containing subfolders.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Define the publishing project</span>
(<span style="color: #859900; font-weight: bold;">setq</span> org-publish-project-alist
      (list
       (list <span style="color: #2aa198;">"try-org-publish-org"</span>
             <span style="color: #657b83; font-weight: bold;">:base-directory</span> <span style="color: #2aa198;">"./content"</span>
             <span style="color: #657b83; font-weight: bold;">:base-extension</span> <span style="color: #2aa198;">"org"</span>
             <span style="color: #657b83; font-weight: bold;">:publishing-directory</span> <span style="color: #2aa198;">"./public"</span>
             <span style="color: #657b83; font-weight: bold;">:publishing-function</span> 'org-html-publish-to-html
             <span style="color: #657b83; font-weight: bold;">:recursive</span> t
             <span style="color: #657b83; font-weight: bold;">:auto-sitemap</span> t
             <span style="color: #657b83; font-weight: bold;">:sitemap-title</span> <span style="color: #2aa198;">"Doumeishi's Mainpage"</span>
             <span style="color: #657b83; font-weight: bold;">:sitemap-format-entry</span> 'dms/org-sitemap-format-entry
             <span style="color: #657b83; font-weight: bold;">:sitemap-sort-files</span> 'anti-chronologically
             <span style="color: #657b83; font-weight: bold;">:sitemap-style</span> 'list
             )
       (list <span style="color: #2aa198;">"try-org-publish-assets"</span>
             <span style="color: #657b83; font-weight: bold;">:base-directory</span> <span style="color: #2aa198;">"./content"</span>
             <span style="color: #657b83; font-weight: bold;">:base-extension</span> <span style="color: #2aa198;">"css</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">js</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">png</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">jpg</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">gif</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">pdf</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">mp3</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">ogg</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">swf</span><span style="color: #859900; font-weight: bold;">\\</span><span style="color: #b58900; font-weight: bold;">|</span><span style="color: #2aa198;">mov"</span>
             <span style="color: #657b83; font-weight: bold;">:publishing-directory</span> <span style="color: #2aa198;">"./public"</span>
             <span style="color: #657b83; font-weight: bold;">:publishing-function</span> 'org-publish-attachment
             <span style="color: #657b83; font-weight: bold;">:recursive</span> t
             )
       )
)
</pre>
</div>

<p>
Finally, we publish all projects.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Generate the site output</span>
(org-publish-all t)

(message <span style="color: #2aa198;">"Publish complete!"</span>)
</pre>
</div>
</div>
</div>
