2024-01-14-TryOrgPublish/notes.html

<div id="outline-container-orgfa168e2" class="outline-2">
<h2 id="orgfa168e2">Questions</h2>
<div class="outline-text-2" id="text-orgfa168e2">
<ol class="org-ol">
<li><p>
Can I customize the way of Emacs searching for intended org files rather than
a base dir + extension?
</p>

<p>
Yes, we can first exclude all files by setting the base extension to <code>"dummy"</code> and then use <code>:include</code>
to include a list of files we want to publish.
</p></li>

<li><p>
Aware of privacy, can I customize the exporting scheme to exclude publishing particular files?
</p>

<p>
Yes, we can set the <code>exclude</code> property. Or we can set the <code>:exclude-tags</code> property.
</p></li>

<li><p>
Can I adjust publication settings for particular subfolders?
</p>

<p>
Yes, we can exclude the subfolder from existing projects, then create a new project for it
and apply different rules for this subfolder.
</p></li>

<li><p>
How the <i>last modified</i> time is set? I want it to be set by the mtime of org files.
</p>

<p>
I am not sure about this. With some test I found that if I run the script in Emacs
then everything work as expected. But if I run the script in terminal by
<code>emacs -Q --script</code> then every exported file will update the modification time
to the current time.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgcd12596" class="outline-2">
<h2 id="orgcd12596">Further consideration</h2>
<div class="outline-text-2" id="text-orgcd12596">
<p>
<i>A slightly complicated setting:</i> my document folder consists of event directories and looks like
</p>

<pre class="example" id="orgb8b8acc">
.
├── 2023-09-03-CustomizePrompt/
├── 2023-11-18-ContentManagementSystem/
├── 2024-01-03-ReviewPham/
├── 2024-01-07-ReviewUnison/
├── 2024-01-11-CodeBlockinLaTeX/
</pre>

<p>
In each event directory, there is an org file <code>notes.org</code> which contains my notes on this event.
I want to generate a sitemap for my document folder (or some folder with the same
strcture) such that I can review what I have done in browser. In particular, I want to
publish only those event notes, i.e., no other org files are exported during the creation of
my sitemap. Moreover, I want to publish those notes in-place, i.e., the generated html should
be placed in the its event directory.
</p>

<p>
In order to do this, we can first define two variables. One is the root directory to be considered,
and is set to <code>~/Document</code>. The other one is a textual file, in which every line specifies a event
name that should not be published.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #859900; font-weight: bold;">defcustom</span> <span style="color: #268bd2;">dms/org-publish-event-root-dir</span> <span style="color: #2aa198;">"~/Documents"</span>
  <span style="color: #2aa198;">"The directory contains a list of event directories."</span>)

(<span style="color: #859900; font-weight: bold;">defcustom</span> <span style="color: #268bd2;">dms/org-publish-nopublish-events-fp</span> <span style="color: #2aa198;">"~/org/nopublish-events.txt"</span>
  <span style="color: #2aa198;">"The file path whose content is a list of event names</span>
<span style="color: #2aa198;">which should not be considered when do publishing.</span>
<span style="color: #2aa198;">This file should be a textual file and each line corresponds to</span>
<span style="color: #2aa198;">an event name."</span>)
</pre>
</div>

<p>
Then we define a function to generate the list of event notes to be published.
In this function I first filtered the event directory under the root folder with
the content of that nopublish file, then I concat the filename <code>notes.org</code>
for each event and check the existence of such file.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">dms/org-publish-get-event-notes</span> ()
  <span style="color: #2aa198;">"Return a list of event notes to be published according to the value</span>
<span style="color: #2aa198;">of dms/org-publish-event-root-dir and dms/org-publish-nopublish-events-fp.</span>

<span style="color: #2aa198;">An event is a directory whose name has the format YYYY-MM-DD-EventName.</span>
<span style="color: #2aa198;">A event note is the file named notes.org under the event directory."</span>
  (<span style="color: #859900; font-weight: bold;">let*</span> ((events (directory-files dms/org-publish-event-root-dir nil
                    <span style="color: #2aa198;">"^[0-9]\\{</span><span style="color: #268bd2;">4\\</span><span style="color: #2aa198;">}-[0-9]\\{</span><span style="color: #268bd2;">2\\</span><span style="color: #2aa198;">}-[0-9]\\{</span><span style="color: #268bd2;">2\\</span><span style="color: #2aa198;">}-.+"</span>))
         (nopublish-event-alist
          (<span style="color: #859900; font-weight: bold;">if</span> dms/org-publish-nopublish-events-fp
              (<span style="color: #859900; font-weight: bold;">with-temp-buffer</span>
                (insert-file-contents dms/org-publish-nopublish-events-fp)
                (split-string (buffer-string) <span style="color: #2aa198;">"\n"</span> t))))
         (filtered-events (seq-difference events nopublish-event-alist))
         (event-notes-to-publish
          (mapcar (<span style="color: #859900; font-weight: bold;">lambda</span> (event) (concat
                                   (file-name-as-directory event)
                                   <span style="color: #2aa198;">"notes.org"</span>)) <span style="color: #cb4b16; font-weight: bold;">filtered-events)))</span>
    (seq-filter (<span style="color: #859900; font-weight: bold;">lambda</span> (event-note)
                  (file-exists-p (concat (file-name-as-directory
                                          dms/org-publish-event-root-dir)
                                         event-note)))
                event-notes-to-publish)))
</pre>
</div>

<p>
After that we define the way to format the event note in the sitemap, i.e.,
formatting as <code>=date= [[path][title]]</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">dms/org-sitemap-format-event-note-entry</span> (entry style project)
  <span style="color: #2aa198;">"Format an event note ENTRY in org-publish PROJECT Sitemap as</span>
<span style="color: #2aa198;">=date= [[file][title]]."</span>
  (<span style="color: #859900; font-weight: bold;">let</span> ((filetitle (org-publish-find-title entry project)))
    (<span style="color: #859900; font-weight: bold;">if</span> (= (length filetitle) 0)
        (format <span style="color: #2aa198;">"*%s*"</span> entry)
      (format <span style="color: #2aa198;">"=%s= [[file:%s][%s]]"</span>
              (format-time-string <span style="color: #2aa198;">"%Y-%m-%d"</span>
                                  (org-publish-find-date entry project))
              entry
              filetitle))))
</pre>
</div>

<p>
Finally, we set up the project alist variable and publish. By the way, we can always check the returned value
of <code>dms/org-publish-get-event-notes</code> to see the list of files to be published.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Define the publishing project</span>
(<span style="color: #859900; font-weight: bold;">setq</span> org-publish-project-alist
      (list
       (list <span style="color: #2aa198;">"event-notes"</span>
             <span style="color: #657b83; font-weight: bold;">:base-directory</span> dms/org-publish-event-root-dir
             <span style="color: #657b83; font-weight: bold;">:base-extension</span> <span style="color: #2aa198;">"dummy"</span>
             <span style="color: #657b83; font-weight: bold;">:include</span> (dms/org-publish-get-event-notes)
             <span style="color: #657b83; font-weight: bold;">:publishing-directory</span> dms/org-publish-event-root-dir
             <span style="color: #657b83; font-weight: bold;">:publishing-function</span> 'org-html-publish-to-html
             <span style="color: #657b83; font-weight: bold;">:recursive</span> nil
             <span style="color: #657b83; font-weight: bold;">:auto-sitemap</span> t
             <span style="color: #657b83; font-weight: bold;">:sitemap-title</span> <span style="color: #2aa198;">"Event Notes"</span>
             <span style="color: #657b83; font-weight: bold;">:sitemap-filename</span> <span style="color: #2aa198;">"index.org"</span>
             <span style="color: #657b83; font-weight: bold;">:sitemap-format-entry</span> 'dms/org-sitemap-format-event-note-entry
             <span style="color: #657b83; font-weight: bold;">:sitemap-sort-files</span> 'anti-chronologically
             <span style="color: #657b83; font-weight: bold;">:sitemap-style</span> 'list
             )))

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Generate the site output</span>
(org-publish-all t)

(message <span style="color: #2aa198;">"Publish complete!"</span>)
</pre>
</div>

<p>
We can place this script in our <code>.emacs.d/</code> directory.
Whenever we want to rebuild the index page of the document folder,
simply visit it and run <code>eval-buffer</code>.
</p>
</div>
</div>
